#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_secretsmanager_secret.secret: Reading...
aws_route53_zone.thomaskimble_zone: Refreshing state... [id=Z06242472H0DG7GFLG30T]
aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=724n8xu7mk]
aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/29037fba-829c-4870-9979-4b1574a8c6fd]
aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z06242472H0DG7GFLG30T__MX]
aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_autodiscover_CNAME]
aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_legacy_CNAME]
aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_email_CNAME]
aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z06242472H0DG7GFLG30T__TXT]
data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
aws_api_gateway_resource.about_page_content: Refreshing state... [id=syryal]
aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
data.aws_secretsmanager_secret_version.current: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d393xlsrttjy5b]
aws_api_gateway_method.about_page_content_method: Refreshing state... [id=agm-724n8xu7mk-syryal-GET]
aws_api_gateway_method_response.about_page_content_method_response: Refreshing state... [id=agmr-724n8xu7mk-syryal-GET-200]
aws_api_gateway_integration.about_page_content_integration: Refreshing state... [id=agi-724n8xu7mk-syryal-GET]
aws_api_gateway_integration_response.about_page_content_integration_response: Refreshing state... [id=agir-724n8xu7mk-syryal-GET-200]
aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_deployment.api_deployment: Refreshing state... [id=7euds1]
aws_amplify_branch.dev: Refreshing state... [id=d393xlsrttjy5b/dev]
aws_amplify_branch.main: Refreshing state... [id=d393xlsrttjy5b/main]
aws_api_gateway_stage.prod: Refreshing state... [id=ags-724n8xu7mk-prod]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d393xlsrttjy5b/thomaskimble.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_domain_name.thomaskimble_api_gateway_domain_name will be created
  + resource "aws_api_gateway_domain_name" "thomaskimble_api_gateway_domain_name" {
      + arn                                    = (known after apply)
      + certificate_arn                        = "arn:aws:acm:eu-west-1:287212251408:certificate/29037fba-829c-4870-9979-4b1574a8c6fd"
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "api.thomaskimble.com"
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags_all                               = (known after apply)

      + endpoint_configuration {
          + types = [
              + "EDGE",
            ]
        }
    }

  # aws_api_gateway_rest_api.thomaskimble will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "thomaskimble" {
        id                           = "724n8xu7mk"
        name                         = "thomaskimble"
        tags                         = {}
        # (8 unchanged attributes hidden)

      ~ endpoint_configuration {
          ~ types            = [
              - "REGIONAL",
              + "EDGE",
            ]
            # (1 unchanged attribute hidden)
        }
    }

  # aws_route53_record.example will be created
  + resource "aws_route53_record" "example" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api"
      + type            = "A"
      + zone_id         = "Z06242472H0DG7GFLG30T"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*